---
kind: type
id: T:Autodesk.Revit.DB.Macros.MacroManagerIterator
source: html/2e602955-0aaf-f39f-720f-d6269ec8ce26.htm
---
# Autodesk.Revit.DB.Macros.MacroManagerIterator

An iterator to a MacroManager.

## Syntax (C#)
```csharp
public class MacroManagerIterator : IEnumerator<MacroModule>
```